# TP6 : STP, OSPF, bigger infra

TP oÃ¹ on avance sur des protocoles toujours trÃ¨s utilisÃ©s, mais qu'on va trouver surtout dans des gros rÃ©seaux.

On considÃ¨re que Ã§a reste des bases en admin rÃ©seau. Au menu donc :

- expÃ©rimenter STP
  - ptite topo simple avec plusieurs switches
- expÃ©rimenter OSPF
  - routage dynamique : les routeurs se partagent leurs routes
  - topo un peu plus fat
  - on en profite pour voir du DHCP Relay

> *Dans ce TP, pas de VLANs pour simplifier, et focus sur le sujet. Dans la vie rÃ©elle, les VLANs sont omniprÃ©sents.*

## Sommaire

- [TP6 : STP, OSPF, bigger infra](#tp6--stp-ospf-bigger-infra)
  - [Sommaire](#sommaire)
  - [0. Setup](#0-setup)
  - [I. STP](#i-stp)
  - [II. OSPF](#ii-ospf)
  - [III. DHCP relay](#iii-dhcp-relay)
  - [IV. Bonus](#iv-bonus)
    - [1. ACL](#1-acl)

## 0. Setup

âžœ **Faites chauffer GNS**

- VM Rocky prÃªte Ã  Ãªtre clonÃ©e
- du switch et routeur Cisco, on reste sur les images des prÃ©cÃ©dents TPs

Hop petit hint en passant, on peut configurer le hostname des routeurs Cisco avec :

```cisco
R1# conf t
R1(config)# hostname meow
meow(config)# incroyable
```

âžœ **Augmentez la RAM des routeurs** dans GNS, surtout celui qui est connectÃ© Ã  internet (partie II.) Ã  256M

## I. STP

On va setup STP, au sein d'une topo simple pour que vous le voyiez en action.

![Topo STP](./img/ma_topo_stp.png)

ðŸŒž **Configurer STP sur les 3 switches**

- bon c'est surtout activÃ© par dÃ©faut en 2023
- je veux bien un `show spanning-tree`
  - y'a forcÃ©ment un port en Ã©tat *BLK* lÃ 

```
IOU1#show spanning-tree | include Interface |Et0/0|Et0/1|Et0/2
Interface           Role Sts Cost      Prio.Nbr Type
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p

IOU2#show spanning-tree | include Interface |Et0/0|Et0/1|Et0/2
Interface           Role Sts Cost      Prio.Nbr Type
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Root FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p

IOU3#show spanning-tree | include Interface |Et0/0|Et0/1|Et0/2
Interface           Role Sts Cost      Prio.Nbr Type
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Root FWD 100       128.2    P2p
Et0/2               Altn BLK 100       128.3    P2p
```

ðŸŒž **AltÃ©rer le spanning-tree** en dÃ©sactivant un port

- dÃ©sactiver juste un port de un switch pour provoquer la mise Ã  jour de STP
- `show spanning-tree` pour voir la diff

> RÃ©fÃ©rez-vous [au mÃ©mo Cisco](../../../cours/memo/cisco.md) pour les commandes STP.

```
IOU1(config)#interface ethernet0/1 (switch 1 vers le switch 2)
IOU1(config-if)#shutdown

IOU1#show spanning-tree | include Interface |Et0/0|Et0/1|Et0/2
Interface           Role Sts Cost      Prio.Nbr Type
Et0/0               Desg FWD 100       128.1    P2p
Et0/2               Desg FWD 100       128.3    P2p

IOU3#show spanning-tree

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Root FWD 100       128.2    P2p
Et0/2               Desg LIS 100       128.3    P2p (swith 3 vers switch 2)
```

ðŸŒž **AltÃ©rer le spanning-tree** en modifiant le coÃ»t d'un lien

- modifier le coÃ»t d'un lien existant pour modifier l'arbre spanning-tree

```
IOU3#show spanning-tree | include Et0/2
Et0/2               Root FWD 100        16.3    P2p
```

ðŸ¦ˆ **`tp6_stp.pcapng`**

- capturez du trafic STP, quelques trames
- interprÃ©tez les trames (rien dans le rendu Ã  Ã©crire, mais juste, fais l'effort de capter ce que les switches Ã©changent comme message)

[Trames trafic STP](/B2_2023/Infra_Tp6/wireshark/tp6_stp.pcapng)

## II. OSPF

OSPF donc, routage dynamique.

On va se cantonner Ã  le setup de faÃ§on simple, et ensuite on mettra en place un service qui consomme ce routage en partie III.

![Topo OSPF](./img/ma_topo_ospf.png)

> Ce sont les *areas* OSPF qui sont reprÃ©sentÃ©es en couleur, pas des rÃ©seaux. ðŸŒ¸

âžœ Tableau d'adressage

- la logique de l'adressage que je vous propose :
  - choix de masque
    - du `/24` pour les rÃ©seaux oÃ¹ y'a des clients
      - classique, simple
    - du `/30` pour les rÃ©seaux entre les routeurs
      - comme Ã§a, on permet vraiment explicitement que deux IPs sur ces rÃ©seaux
  - choix des octets
    - `10.6.` pour les deux premiers octets
      - 10 pas chiant comme d'hab
      - 6 pour TP6 comme d'hab
    - pour le troisiÃ¨me octet
      - entre les routeurs : `10.6.13.` l'octet qui suit :
        - 13 indique le rÃ©seau entre le routeur 1 et le routeur 3
        - 13 et pas 31 parce que je lis de gauche Ã  droite perso
      - rÃ©seaux clients : `10.6.1.`
        - arbitraire, y'a un rÃ©seau 1, un rÃ©seau 2, etc.

| Node          | `10.6.1.0/24` | `10.6.2.0/24` | `10.6.3.0/24` | `10.6.41.0/30` | `10.6.13.0/30` | `10.6.21.0/30` | `10.6.23.0/30` | `10.6.52.0/30` |
| ------------- | ------------- | ------------- | ------------- | -------------- | -------------- | -------------- | -------------- | -------------- |
| `waf.tp6.b1`  | `10.6.1.11`   | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `dhcp.tp6.b1` | `10.6.1.253`  | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `meo.tp6.b1`  | âŒ            | `10.6.2.11`   | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `john.tp6.b1` | âŒ            | âŒ            | `10.6.3.11`   | âŒ             | âŒ             | âŒ             | âŒ             | âŒ             |
| `R1`          | âŒ            | âŒ            | `10.6.3.254`  | `10.6.41.1`    | `10.6.13.1`    | `10.6.21.1`    | âŒ             | âŒ             |
| `R2`          | âŒ            | âŒ            | âŒ            | âŒ             | âŒ             | `10.6.21.2`    | `10.6.23.2`    | `10.6.52.2`    |
| `R3`          | âŒ            | âŒ            | âŒ            | âŒ             | `10.6.13.2`    | âŒ             | `10.6.23.1`    | âŒ             |
| `R4`          | `10.6.1.254`  | `10.6.2.254`  | âŒ            | `10.6.41.2`    | âŒ             | âŒ             | âŒ             | âŒ             |
| `R5`          | âŒ            | âŒ            | âŒ            | âŒ             | âŒ             | âŒ             | âŒ             | `10.6.52.1`    |

ðŸŒž **Montez la topologie**

- IP statiques sur tout le monde
  - assurez-vous que les pings passent au sein de chacun des LANs
  - au fur et Ã  mesure que vous configurez

```
R5#ping 10.6.52.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.52.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/18/24 ms
R5#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/30/44 ms
R5#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.52.1       YES manual up                    up
FastEthernet0/1            192.168.94.133  YES DHCP   up                    up
FastEthernet1/0            unassigned      YES unset  administratively down down
FastEthernet2/0            unassigned      YES unset  administratively down down
NVI0                       10.6.52.1       YES unset  up                    up

-----------------------------------------------------------------

R2#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.21.2       YES manual up                    up
FastEthernet0/1            10.6.23.2       YES manual up                    up
FastEthernet1/0            10.6.52.2       YES manual up                    up
FastEthernet2/0            unassigned      YES unset  administratively down down
R2#
R2#ping 10.6.52.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.52.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/12/24 ms
R2#ping 10.6.21.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.21.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/19/20 ms
R2#ping 10.6.23.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.23.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/10/16 ms

-------------------------------------------------------

R3#ping 10.6.23.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.23.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/19/28 ms
R3#ping 10.6.13.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.13.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/20/24 ms
R3#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.13.2       YES manual up                    up
FastEthernet0/1            10.6.23.1       YES manual up                    up
FastEthernet1/0            unassigned      YES unset  administratively down down
FastEthernet2/0            unassigned      YES unset  administratively down down

---------------------------------------------------------------

R1#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.41.1       YES manual up                    up
FastEthernet0/1            10.6.21.1       YES manual up                    up
FastEthernet1/0            10.6.13.1       YES manual up                    up
FastEthernet2/0            10.6.3.254      YES manual up                    up
R1#ping 10.6.13.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.13.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 8/14/24 ms
R1#ping 10.6.21.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.21.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 8/18/28 ms
R1#ping 10.6.3.11

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.3.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/11/16 ms
R1#ping 10.6.41.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.41.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/8/16 ms

--------------------------------------------------------------

R4#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.1.254      YES manual up                    up
FastEthernet0/1            10.6.2.254      YES manual up                    up
FastEthernet1/0            10.6.41.2       YES manual up                    up
FastEthernet2/0            unassigned      YES unset  administratively down down
R4#ping 10.6.41.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.41.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 20/21/24 ms
R4# ping 10.6.23.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.23.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R4#ping 10.6.1.11

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.1.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/10/20 ms
R4#ping 10.6.2.11

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.2.11, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/9/20 ms

R4#ping 10.6.1.253

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.6.1.253, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/13/36 ms


```

- configuration d'un NAT sur le routeur connectÃ© Ã  internet
- **aucune route statique ne doit Ãªtre ajoutÃ©e nulle part**
- dÃ©finissez aux clients (VPCS ou VMs) des IPs statiques et dÃ©finissez leur gateway
  - ils auront toujours pas internet, car leur routeur n'a pas internet !

```
john.tp6.b1> show ip
NAME        : john.tp6.b1[1]
IP/MASK     : 10.6.3.11/24
GATEWAY     : 10.6.3.254

john.tp6.b1> ping 10.6.3.254
84 bytes from 10.6.3.254 icmp_seq=1 ttl=255 time=9.069 ms
84 bytes from 10.6.3.254 icmp_seq=2 ttl=255 time=5.597 ms

john.tp6.b1> ping 1.1.1.1
*10.6.3.254 icmp_seq=1 ttl=255 time=5.652 ms (ICMP type:3, code:1, Destination host unreachable)
*10.6.3.254 icmp_seq=2 ttl=255 time=2.507 ms (ICMP type:3, code:1, Destination host unreachable)

--------------------------------------------

waf.tp6.b1> show ip

NAME        : waf.tp6.b1[1]
IP/MASK     : 10.6.1.11/24
GATEWAY     : 10.6.1.254
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10005
RHOST:PORT  : 127.0.0.1:10006
MTU:        : 1500

waf.tp6.b1> ping 10.6.1.254
84 bytes from 10.6.1.254 icmp_seq=1 ttl=255 time=20.973 ms
84 bytes from 10.6.1.254 icmp_seq=2 ttl=255 time=5.437 ms

----------------------------------------------

meo.tp6.b1> show ip

NAME        : meo.tp6.b1[1]
IP/MASK     : 10.6.2.11/24
GATEWAY     : 10.6.2.254
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10007
RHOST:PORT  : 127.0.0.1:10008
MTU:        : 1500

meo.tp6.b1> ping 10.6.2.254
84 bytes from 10.6.2.254 icmp_seq=1 ttl=255 time=20.669 ms
84 bytes from 10.6.2.254 icmp_seq=2 ttl=255 time=7.946 ms
```

- aucune configuration particuliÃ¨re Ã  faire sur `dhcp.tp6.b2` pour le moment, on fera Ã§a en partie III.
  - juste une IP statique, pas de setup particulier

ðŸŒž **Configurer OSPF sur tous les routeurs**

- tous les routeurs doivent partager tous les rÃ©seaux auxquels ils sont connectÃ©s
- un petit `show running-config` oÃ¹ vous enlevez ce que vous n'avez pas tapÃ© pour le rendu !

```
R2#show run 
interface FastEthernet0/0
 ip address 10.6.21.2 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.6.23.2 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet1/0
 ip address 10.6.52.2 255.255.255.252
 duplex auto
 speed auto
!
router ospf 1
 router-id 2.2.2.2
 log-adjacency-changes
 network 10.6.21.0 0.0.0.3 area 0
 network 10.6.23.0 0.0.0.3 area 0
 network 10.6.52.0 0.0.0.3 area 1
 
------------------------------

R5#show run
interface FastEthernet0/0
 ip address 10.6.52.1 255.255.255.252
 ip nat inside
 ip virtual-reassembly
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address dhcp
 ip nat outside
 ip virtual-reassembly
 duplex auto
 speed auto
! 
router ospf 1
 router-id 5.5.5.5
 log-adjacency-changes
 network 10.6.52.0 0.0.0.3 area 1
 default-information originate always

------------------------------

R3#show run
interface FastEthernet0/0
 ip address 10.6.13.2 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.6.23.1 255.255.255.252
 duplex auto
 speed auto
!
router ospf 1
 router-id 3.3.3.3
 log-adjacency-changes
 network 10.6.13.0 0.0.0.3 area 0
 network 10.6.23.0 0.0.0.3 area 0

------------------------------

R4#show run
interface FastEthernet0/0
 ip address 10.6.1.254 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.6.2.254 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 ip address 10.6.41.2 255.255.255.252
 duplex auto
 speed auto
! 
router ospf 1
 router-id 4.4.4.4
 log-adjacency-changes
 network 10.6.1.0 0.0.0.255 area 3
 network 10.6.2.0 0.0.0.255 area 3
 network 10.6.41.0 0.0.0.3 area 3
 
------------------------------

R1#show run
interface FastEthernet0/0
 ip address 10.6.41.1 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.6.21.1 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet1/0
 ip address 10.6.13.1 255.255.255.252
 duplex auto
 speed auto
!
interface FastEthernet2/0
 ip address 10.6.3.254 255.255.255.0
 duplex auto
 speed auto
!
router ospf 1
 router-id 1.1.1.1
 log-adjacency-changes
 network 10.6.3.0 0.0.0.3 area 2
 network 10.6.3.0 0.0.0.255 area 2
 network 10.6.13.0 0.0.0.3 area 0
 network 10.6.21.0 0.0.0.3 area 0
 network 10.6.41.0 0.0.0.3 area 3
```

- et un `show ip ospf neighbor` + `show ip route` sur chaque routeur
- n'oubliez pas de partager la route par dÃ©faut de R5 avec une commande OSPF spÃ©cifique

> RÃ©fÃ©rez-vous [au mÃ©mo Cisco](../../../cours/memo/cisco.md) pour les commandes OSPF.

```
R2#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
3.3.3.3           1   FULL/DR         00:00:33    10.6.23.1       FastEthernet0/1
1.1.1.1           1   FULL/BDR        00:00:34    10.6.21.1       FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:33    10.6.52.1       FastEthernet1/0

R2#show ip route
Gateway of last resort is 10.6.52.1 to network 0.0.0.0

     10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
O       10.6.13.0/30 [110/11] via 10.6.21.1, 00:35:54, FastEthernet0/0
O IA    10.6.1.0/24 [110/30] via 10.6.21.1, 00:35:54, FastEthernet0/0
O IA    10.6.2.0/24 [110/30] via 10.6.21.1, 00:35:54, FastEthernet0/0
O IA    10.6.3.0/24 [110/11] via 10.6.21.1, 00:35:54, FastEthernet0/0
C       10.6.21.0/30 is directly connected, FastEthernet0/0
C       10.6.23.0/30 is directly connected, FastEthernet0/1
O IA    10.6.41.0/30 [110/20] via 10.6.21.1, 00:35:55, FastEthernet0/0
C       10.6.52.0/30 is directly connected, FastEthernet1/0
O*E2 0.0.0.0/0 [110/1] via 10.6.52.1, 00:21:34, FastEthernet1/0

---------------------

R5#show ip route
Gateway of last resort is 192.168.94.2 to network 0.0.0.0

C    192.168.94.0/24 is directly connected, FastEthernet0/1
     10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
O IA    10.6.13.0/30 [110/21] via 10.6.52.2, 00:15:35, FastEthernet0/0
O IA    10.6.1.0/24 [110/40] via 10.6.52.2, 00:15:35, FastEthernet0/0
O IA    10.6.2.0/24 [110/40] via 10.6.52.2, 00:15:35, FastEthernet0/0
O IA    10.6.3.0/24 [110/21] via 10.6.52.2, 00:15:35, FastEthernet0/0
O IA    10.6.21.0/30 [110/20] via 10.6.52.2, 00:15:35, FastEthernet0/0
O IA    10.6.23.0/30 [110/20] via 10.6.52.2, 00:15:36, FastEthernet0/0
O IA    10.6.41.0/30 [110/30] via 10.6.52.2, 00:15:36, FastEthernet0/0
C       10.6.52.0/30 is directly connected, FastEthernet0/0
S*   0.0.0.0/0 [254/0] via 192.168.94.2

R5#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/DR         00:00:39    10.6.52.2       FastEthernet0/0

------------------------------

R4#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   FULL/BDR        00:00:36    10.6.41.1       FastEthernet1/0

R4#show ip route
Gateway of last resort is 10.6.41.1 to network 0.0.0.0

     10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
O IA    10.6.13.0/30 [110/2] via 10.6.41.1, 00:37:50, FastEthernet1/0
C       10.6.1.0/24 is directly connected, FastEthernet0/0
C       10.6.2.0/24 is directly connected, FastEthernet0/1
O IA    10.6.3.0/24 [110/2] via 10.6.41.1, 00:37:50, FastEthernet1/0
O IA    10.6.21.0/30 [110/11] via 10.6.41.1, 00:37:50, FastEthernet1/0
O IA    10.6.23.0/30 [110/12] via 10.6.41.1, 00:37:50, FastEthernet1/0
C       10.6.41.0/30 is directly connected, FastEthernet1/0
O IA    10.6.52.0/30 [110/12] via 10.6.41.1, 00:37:45, FastEthernet1/0
O*E2 0.0.0.0/0 [110/1] via 10.6.41.1, 00:23:19, FastEthernet1/0

------------------------------

R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/DR         00:00:30    10.6.21.2       FastEthernet0/1
3.3.3.3           1   FULL/DR         00:00:36    10.6.13.2       FastEthernet1/0
4.4.4.4           1   FULL/DR         00:00:34    10.6.41.2       FastEthernet0/0

R1#show ip route
Gateway of last resort is 10.6.21.2 to network 0.0.0.0

     10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
C       10.6.13.0/30 is directly connected, FastEthernet1/0
O       10.6.1.0/24 [110/20] via 10.6.41.2, 00:39:03, FastEthernet0/0
O       10.6.2.0/24 [110/20] via 10.6.41.2, 00:39:03, FastEthernet0/0
C       10.6.3.0/24 is directly connected, FastEthernet2/0
C       10.6.21.0/30 is directly connected, FastEthernet0/1
O       10.6.23.0/30 [110/11] via 10.6.13.2, 00:39:03, FastEthernet1/0
C       10.6.41.0/30 is directly connected, FastEthernet0/0
O IA    10.6.52.0/30 [110/11] via 10.6.21.2, 00:38:55, FastEthernet0/1
O*E2 0.0.0.0/0 [110/1] via 10.6.21.2, 00:24:28, FastEthernet0/1

------------------------------

R3#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/BDR        00:00:34    10.6.23.2       FastEthernet0/1
1.1.1.1           1   FULL/BDR        00:00:36    10.6.13.1       FastEthernet0/0

R3#show ip route
Gateway of last resort is 10.6.23.2 to network 0.0.0.0

     10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
C       10.6.13.0/30 is directly connected, FastEthernet0/0
O IA    10.6.1.0/24 [110/30] via 10.6.13.1, 00:39:31, FastEthernet0/0
O IA    10.6.2.0/24 [110/30] via 10.6.13.1, 00:39:31, FastEthernet0/0
O IA    10.6.3.0/24 [110/11] via 10.6.13.1, 00:39:31, FastEthernet0/0
O       10.6.21.0/30 [110/20] via 10.6.23.2, 00:39:31, FastEthernet0/1
                     [110/20] via 10.6.13.1, 00:39:21, FastEthernet0/0
C       10.6.23.0/30 is directly connected, FastEthernet0/1
O IA    10.6.41.0/30 [110/20] via 10.6.13.1, 00:39:32, FastEthernet0/0
O IA    10.6.52.0/30 [110/11] via 10.6.23.2, 00:39:32, FastEthernet0/1
O*E2 0.0.0.0/0 [110/1] via 10.6.23.2, 00:24:56, FastEthernet0/1
```

ðŸŒž **Test**

- faites des `ping` dans tous les sens
- c'est simple hein : normalement tout le monde peut ping tout le monde
- et mÃªme tout le monde a internet y compris les clients
- mettez moi quelques `ping` dans le compte-rendu

```
waf.tp6.b1> ping 10.6.1.254
84 bytes from 10.6.1.254 icmp_seq=1 ttl=255 time=19.553 ms
84 bytes from 10.6.1.254 icmp_seq=2 ttl=255 time=10.322 ms
84 bytes from 10.6.1.254 icmp_seq=3 ttl=255 time=11.683 ms

waf.tp6.b1> ping 10.6.1.253
84 bytes from 10.6.1.253 icmp_seq=1 ttl=64 time=1.783 ms
84 bytes from 10.6.1.253 icmp_seq=2 ttl=64 time=2.346 ms
84 bytes from 10.6.1.253 icmp_seq=3 ttl=64 time=2.169 ms

waf.tp6.b1> ping 10.6.2.11
10.6.2.11 icmp_seq=1 timeout
10.6.2.11 icmp_seq=2 timeout
84 bytes from 10.6.2.11 icmp_seq=3 ttl=63 time=20.694 ms
84 bytes from 10.6.2.11 icmp_seq=4 ttl=63 time=56.949 ms

waf.tp6.b1> ping 10.6.3.11
10.6.3.11 icmp_seq=1 timeout
10.6.3.11 icmp_seq=2 timeout
84 bytes from 10.6.3.11 icmp_seq=3 ttl=62 time=39.256 ms
84 bytes from 10.6.3.11 icmp_seq=4 ttl=62 time=48.802 ms

waf.tp6.b1> ping 10.6.3.254
84 bytes from 10.6.3.254 icmp_seq=1 ttl=254 time=55.817 ms
84 bytes from 10.6.3.254 icmp_seq=2 ttl=254 time=29.448 ms

waf.tp6.b1> ping 10.6.41.1
84 bytes from 10.6.41.1 icmp_seq=1 ttl=254 time=24.274 ms
84 bytes from 10.6.41.1 icmp_seq=2 ttl=254 time=29.374 ms

waf.tp6.b1> ping 10.6.23.1
84 bytes from 10.6.23.1 icmp_seq=1 ttl=253 time=55.987 ms
84 bytes from 10.6.23.1 icmp_seq=2 ttl=253 time=49.602 ms
84 bytes from 10.6.23.1 icmp_seq=3 ttl=253 time=38.457 ms

waf.tp6.b1> ping 1.1.1.1
84 bytes from 1.1.1.1 icmp_seq=1 ttl=124 time=90.690 ms
84 bytes from 1.1.1.1 icmp_seq=2 ttl=124 time=103.346 ms
84 bytes from 1.1.1.1 icmp_seq=3 ttl=124 time=79.950 ms
84 bytes from 1.1.1.1 icmp_seq=4 ttl=124 time=91.247 ms
84 bytes from 1.1.1.1 icmp_seq=5 ttl=124 time=78.818 ms
```

ðŸ¦ˆ **`tp6_ospf.pcapng`**

- capturez des BPDUs lÃ  oÃ¹ vous voulez
- interprÃ©tez les BPDUs

C'est le routeur 1 qui tient informÃ© des routes qu'il a et  le routeur 2 dit "ouais, c'est moi cette route et moi, j'ai Ã§a comme routes"

[tp6_ospf.pcapng](/B2_2023/Infra_Tp6/wireshark/tp6_ospf.pcapng)

> *Un BPDU c'est juste le nom qu'on donne Ã  une trame OSPF Ã©changÃ©e entre deux routeurs.*

## III. DHCP relay

âžœ **Un problÃ¨me trÃ¨s rÃ©current pour pas dire omniprÃ©sent avec DHCP c'est que Ã§a marche que dans un LAN.**

Si t'as un serveur DHCP, et plein de rÃ©seaux comme c'est le cas ici, c'est le bordel :

- un DHCP Request, qui part en broadcast ne passe pas un routeur
- en effet, pour changer de rÃ©seau, il faut construire des paquets IP
- hors quand tu fais ton DHCP Request c'est Ã§a que tu cherches : avoir une IP
- dans notre topo actuelle, impossible que John contacte le serveur DHCP

âžœ **DHCP Relay !**

- on va demander Ã  un routeur, s'il reÃ§oit des trames DHCP de les faire passer vers notre serveur DHCP
- si le serveur DHCP le supporte, il rÃ©pondra donc au routeur, qui fera passer au client

ðŸŒž **Configurer un serveur DHCP** sur `dhcp.tp6.b1`

- mÃªme setup que d'habitude [(c'est ce lien que tu cherches ?)](https://www.server-world.info/en/note?os=Rocky_Linux_8&p=dhcp&f=1)
- votre serveur DHCP donne des IPs dans les rÃ©seaux
  - `10.6.1.0/24`
    - de `10.6.1.100` Ã  `10.6.1.200`
    - informe les clients de l'adresse de la passerelle de ce rÃ©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
  - `10.6.3.0/24`
    - de `10.6.3.100` Ã  `10.6.3.200`
    - informe les clients de l'adresse de la passerelle de ce rÃ©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
- pour le compte-rendu Ã§a me suffit :
  - `sudo cat /etc/dhcp/dhcpd.conf`
  - `systemctl status dhcpd`

```
[joris@dhcptp6b2 ~]$ sudo cat /etc/dhcp/dhcpd.conf
#
# DHCP Server Configuration file.
#   see /usr/share/doc/dhcp-server/dhcpd.conf.example
#   see dhcpd.conf(5) man page
#
default-lease-time 900;
max-lease-time 10800;

authoritative;

subnet 10.6.1.0 netmask 255.255.255.0 {
range 10.6.1.100 10.6.1.200;
option routers 10.6.1.254;
option subnet-mask 255.255.255.0;
option domain-name-servers 1.1.1.1;
}

subnet 10.6.3.0 netmask 255.255.255.0 {
range 10.6.3.100 10.6.3.200;
option routers 10.6.3.254;
option subnet-mask 255.255.255.0;
option domain-name-servers 1.1.1.1;
}
```

ðŸŒž **Configurer un DHCP relay sur la passerelle de John**

- vÃ©rifier que Waf et John peuvent rÃ©cupÃ©rer une IP en DHCP

```
waf.tp6.b1> ip dhcp
DDORA IP 10.6.1.100/24 GW 10.6.1.254

john.tp6.b1> ip dhcp
DDORA IP 10.6.3.100/24 GW 10.6.3.254
```

- check les logs du serveur DHCP pour voir les DORA
  - je veux ces 4 lignes de logs dans le compte-rendu
  - pour John et pour Waf

```
[joris@dhcptp6b2]journalctl -xeu dhcpd.service
Dec 07 12:21:33 dhcptp6b2 dhcpd: DHCPDISCOVER from 00:58:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:21:33 dhcptp6b2 dhcpd: DHCPOFFER on 10.6.1.100 to 00:50:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:21:34 dhcptp6b2 dhcpd: DHCPREQUEST for 10.6.1.100 (10.6.1.253) from 00:50:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:21:34 dhcptp6b2 dhcpd: DHCPACK on 10.6.1.100 to 00:50:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:21:59 dhcptp6b2 dhcpd: reuse_lease: lease age 25 (secs) under 25% threshold, reply with unaltered, existing lease for 10.6.1.100
Dec 07 12:21:59 dhcptp6b2 dhcpd: DHCPDISCOVER from 00:58:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:21:59 dhcptp6b2 dhcpd: DHCPOFFER on 10.6.1.100 to 00:50:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:22:00 dhcptp6b2 dhcpd: reuse_lease: lease age 26 (secs) under 25% threshold, reply with unaltered, existing lease for 10.6.1.100
Dec 07 12:22:00 dhcptp6b2 dhcpd: DHCPREQUEST for 10.6.1.100 (10.6.1.253) from 00:58:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:22:00 dhcptp6b2 dhcpd: DHCPACK on 10.6.1.100 to 00:50:79:66:68:00 (waf.tp6.b11) via enp0s3
Dec 07 12:22:07 dhcptp6b2 dhcpd: DHCPDISCOVER from 00:50:79:66:68:02 (john.tp6.b11) via 10.6.3.254
Dec 07 12:22:07 dhcptp6b2 dhcpd: DHCPOFFER on 10.6.3.100 to 00:50:79:66:68:02 (john.tp6.b11) via 10.6.3.254
Dec 07 12:22:08 dhcptp6b2 dhcpd: DHCPREQUEST for 10.6.3.100 (10.6.1.253) from 00:50:79:66:68:02 (john.tp6.b11) via 10.6.3.254
Dec 07 12:22:08 dhcptp6b2 dhcpd: DHCPACK on 10.6.3.100 to 00:50:79:66:68:02 (john.tp6.b11) via 10.6.3.254
```

- la conf sur le routeur qui est la passerelle de John c'est :

```cisco
R1#conf t
R1(config)#interface fastEthernet 2/0 # interface qui va recevoir des requÃªtes DHCP
R1(config-if)#ip helper-address <DHCP_SERVER_IP_ADDRESS>
```

> *Ui c'est tout. Bah... quoi de plus ? Il a juste besoin de savoir Ã  qui faire passer les requÃªtes !*

## IV. Bonus

### 1. ACL

C'est un peu moche que les clients puissent `ping` les IPs des routeurs de l'autre cÃ´tÃ© de l'infra.

Normalement, il peut joindre sa passerelle, internet, Ã©puicÃ©tou.

ðŸŒž **Configurer une access-list**

- Ã§a se fait sur les routeurs
- le but :
  - les clients peuvent ping leur passerelle
  - et internet
  - Ã©puicÃ©tou

